Revit 2027 API
ParameterTypeId.RoomFinishWall Property
 "Wall Finish"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomFinishWall { get; }
Public Shared ReadOnly Property RoomFinishWall As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomFinishWall {
	ForgeTypeId^ get ();
}
static member RoomFinishWall : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace